#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов
#  списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

nums= [2,3,5,9,3,4]
sum = 0
for i in range(1,len(nums),2):
    sum= sum + nums[i]
    print(nums[i],end=",")  #3,9,4,
    
    
print(" сумма элем.стоящих на нечетной позиции =" ,sum)




# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и 
# последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


num= [2, 3, 5, 6,7]
test=[]
for i in range((len(num)+1)//2):
    test.append(num[i]* num[-1-i])

print (test)


# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
#  между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19

nums2=[1.1, 1.2, 3.1, 5, 10.01]
min1=1
max1=0
for f in nums2:
    if f - int(f)==0:
        continue
    if f- int(f) >=max1:
        max1= f-int(f)
    if f- int(f) <=min1:
        min1= f-int(f)    
print(max1)    
print(min1)
print("разница  между максимальным и минимальным значением дробной части элементов  = ", max1 - min1)


# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

a=int(input( " введите число, которое нужно преобразовать в двоичное число: "))

# print(bin(a))
b = ''
while a > 0:
    b = str(a % 2) + b 
    a = a // 2
print(b)


# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.

# Пример:

# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 
# 13, 21] [Негафибоначчи](https://ru.wikipedia.org/wiki/%D0%9D%D0%B5%D0%B3%D0%B0%D1%84%D0%B8%D0
# %B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8#:~:text=%D0%92%20%D0%BC%D0%B0%D1%82%D0%B5%D0%BC%D
# 0%B0%D1%82%D0%B8%D0%BA%D0%B5%2C%20%D1%87%D0%B8%D1%81%D0%BB%D0%B0%20%D0%BD%D0%B5%D0%B3%D0%B0%
# D1%84%D0%B8%D0%B1%D0%BE%D0%BD%D0%B0%D1%87%D1%87%D0%B8%20%E2%80%94%20%D0%BE%D1%82%D1%80%D0%B8%
# D1%86%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD%D0%BE%20%D0%B8%D0%BD%D0%B4%D0%B5%D0%BA%D1%81%D0%B8
# %D1%80%D0%BE%D0%B2%D0%B0%D0%BD%D0%BD%D1%8B%D0%B5%20%D1%8D%D0%BB%D0%B5%D0%BC%D0%B5%D0%BD%D1%82
# %D1%8B%20%D0%BF%D0%BE%D1%81%D0%BB%D0%B5%D0%B4%D0%BE%D0%B2%D0%B0%D1%82%D0%B5%D0%BB%D1%8C%D0%BD
# %D0%BE%D1%81%D1%82%D0%B8%20%D1%87%D0%B8%D1%81%D0%B5%D0%BB%20%D0%A4%D0%B8%D0%B1%D0%BE%D0%BD%D0%
# B0%D1%87%D1%87%D0%B8.)

# n=int(input(" введите число : "))
# n1=0
# n2=1
# for i in range(2, n):
#     n1, n2 = n2, n1 + n2
#     # print(n)-----------





